[
  {
    "review_id": "R1HFGU6PSH9UWV",
    "rating": 5,
    "review_title": "",
    "review_body": "I bought this exact same very powerful device about 10 years ago and it lasted about 3 years. The motor is still good but the cloth wore out and because a pillow case works OK, but is not perfect, I decided to buy another one. It is a miracle for my lower back and does not bog down the motor when I lay on it with all my weight. It's a very powerful motor and I highly recommend this product. DO NOT waste your money on cheap knock-offs. There are none that compare to the overall high quality of this high-performance massager.",
    "reviewer_name": "USFreedom2025-Q",
    "review_date": "November 3, 2025",
    "verified_purchase": true,
    "helpful_count": 7
  },
  {
    "review_id": "R2RMKWKP71QM7U",
    "rating": 5,
    "review_title": "",
    "review_body": "I purchased this product in the fall of 2022 and have had it for 2 and 1/2 years now. I love it! It is so effective and so easy to use. I have a dedicated chair in my room that it stays in, but I can easily take it downstairs to the couch and have it be just as effective. I struggle with a lot of muscle tension, and the option for heat or no heat is so great. It would be nice if it could have some additional settings, but I don't really need it. Not when it's such a dependable worker. I've used it for an hour straight and it still works even when I'm leaning on it. I'm only about 150. But I have other massagers that won't even make it the full 15 or 20 minutes they say that they're supposed to do if I relax against it. This thing is strong and gets the job done! And the heat really lets your muscles relax a little more so the kneading can do its job. I love this thing so much that I've bought a few more to give as gifts to friends. And I like that since it is small it is easy to move from my lower back to my middle back to shoulders. Without having a big heavy chair that's dedicated. Love this little guy!",
    "reviewer_name": "Gorilla Quandary",
    "review_date": "February 20, 2025",
    "verified_purchase": true,
    "helpful_count": 11
  },
  {
    "review_id": "R2WHYO8MAGURJ4",
    "rating": 4,
    "review_title": "",
    "review_body": "This massager works amazingly.. it will kneed deep into your back with non-painful upward and downward compressing pressure. (Like how a masseuse would use their thumbs to circle toward each other) It has heated or non-headed mode, and when the cover wore out (which is inevitable because of the friction created by the kneeding), Zyllion promptly honored the year warranty and mailed me a new cover USPS express. For $40, it's hard not to give this massager 5 stars, however, there are a couple notable flaws which keep it from being an unbelievable deal.\nThe Cons:\n**As mentioned previously, the friction from the kneeding makes it inevitable that the stitching joining materials will be torn. It did, however, take 3-4 months of heavy use (and I'm a 280# guy) before the stitching gave way, so I feel I got my value out of the product. The fact that they replaced the cover so that I will get even more life out of the product is great! Incidentally, I tried sewing a cotton patch to repair the cover myself, however, any material other than a slick nylon/polyester catches on the wheels, and gets twisted into oblivion.\n**When not run in heating mode, the unit can operate fairly indefinitely, though it will gradually heat up from use.\n**When run in heating mode, the unit can run for 3-4 consecutive cycles (a cycle seems to take a couple minutes) before overheating and needing to be left alone for a bit.\n**the quick disconnect is more of an inevitable disconnect. It makes the unit close to unusable, except that you can wrap it around the elastic band so it doesn't pull free. Placing the pillow against a chair for using it will often work the quick disconnect free.\n\nThe Pros:\n** Works amazing! Use it for your lower or upper back, your neck, your thighs or your calves.. the kneeding effect is useful anywhere you can create opposing pressure against the pillow. Works well enough that I hear the occassional pop as my joints loosen up, and my back usually cracks after use. I'd estimate the pillow can handle about 10 lbs of pressure before the motor starts to object. This means if put it on the ground and lay with your back on it, you'll probably slow down, and shorten the life of, the motor.. but if you prop yourself with pillows or foam roller to alleviate the pressure...\n** Has heated or non-heated mode. The heat really helps to work out the kinks, particularly if it's cold out.\n** Really compact. Smaller than most pillows, though not at all squishy.\n** Can run virtually non-stop when not running in heat mode.\n** Can run in both car and home, and, I feel, makes driving more comfortable as it provides lower back support helping me sit upright.",
    "reviewer_name": "Critical Insights",
    "review_date": "June 20, 2018",
    "verified_purchase": true,
    "helpful_count": 27
  },
  {
    "review_id": "R3TW9R1VFZ6E0E",
    "rating": 5,
    "review_title": "",
    "review_body": "The massager is very sturdy and quite strong with the rotating heads massaging and continuing to spin despite weight put on it, while lying down on it or putting a leg or whole body side onto it. My wife loves it and uses it the most, and this is our second one, same model.\n\nThere is a problem with the wiring fraying with repetitive use or its having on-off-on again connectivity issues. I wrapped the wire around the insulation with additional wire wrap near the wire going into the device, the connector parts, and it’s working better, it seems. I did this right after unboxing after the 1-year (warranty extended to 2-year) warranty replacement. The warranty replacement went smoothly, the operator friendly, nice.\n\nOther than the wiring, great product. Great price point too, although we’ve used and have owned much more expensive massagers, my wife keeps using this one and asked for the same make, model, despite my offering to buy her a more high-end one. She says it’s easier to use while on the sofa watching tv or doing work at home.",
    "reviewer_name": "Steven Huh",
    "review_date": "November 6, 2025",
    "verified_purchase": true,
    "helpful_count": 3
  },
  {
    "review_id": "R2HMFLQFW69006",
    "rating": 5,
    "review_title": "",
    "review_body": "As as senior I recently suffered from a fall that injured my lower back muscles. A physical therapist told me I needed myofascial release therapy. It is a manual therapy that uses gentle, sustained pressure to release restrictions in the fascia, the connective tissue that surrounds and supports muscles, bones, and organs. This hands-on technique aims to alleviate pain, stiffness, and dysfunction caused by tight or restricted fascia. It can be used to treat a wide range of conditions, including back and neck pain, fibromyalgia, and sports injuries, with benefits such as increased range of motion and reduced pain.  I tried to find that therapy locally. Cost was 60-80 dollars for 30 minutes. I bought this item and I have used it three times already. It is amazing with it's soothing results. The heat is very comfortable. It has already paid for itself.",
    "reviewer_name": "Pubtym",
    "review_date": "November 8, 2025",
    "verified_purchase": true,
    "helpful_count": 2
  },
  {
    "review_id": "RYY1VU0SNCD7E",
    "rating": 5,
    "review_title": "",
    "review_body": "I love this product and have suggested it to my family and friends with back pain and they have had the same wonderful experience. It works incredibly well and a natural remedy without pain meds or expensive PT. On top of that, the best customer service I have ever experienced.\nI highly recommend this company and products.",
    "reviewer_name": "HM",
    "review_date": "November 3, 2025",
    "verified_purchase": true,
    "helpful_count": 3
  },
  {
    "review_id": "R3N6UEYPR1CN34",
    "rating": 3,
    "review_title": "",
    "review_body": "I'm right in the middle for this little massager. I researched a bunch and this one seemed to have the best reviews, but I'm just a little disappointed for my needs and might get something else.\n\nPROS\n-Holds up well to pressure! I really try to dig into certain places and so far, after about 5 uses, it's still working, doesn't stop, and keeps massaging. I like that a lot. It goes a bit slower sometimes but I trust it will keep going.\n-Heat is really nice and soothing and not too hot. Be warned, however, I was pressing hard on my bare skin and got a bit chafed on the heat setting because I was digging into the skin. It wouldn't do that normally, though, it was the way I was using it. Overall the heat is mild and a perfect temp.\n-Light and has a long cord, fairly easy to move around.\n-Has given me some occasional relief when I've been able to get the right position, for a good night sleep.\n-I have had some luck around the lower/mid-neck, even though it's not designed for that. I just move it so one side gets the area I want, which feels good. But overall this is a bit too wide to give a nice \"squeeze\" to the neck. I'm small, 5'4\" and 125 so if you are bigger with a bigger neck this would maybe be great!\n\nCONS\n-The directional-switch of the motors is automatic. It's nice sometimes, but I think I'd prefer to be able to control when the rotation switches direction. Often I will be in a sweet spot and it will change and then I'll have to adjust a bit. Nothing terrible but if you are looking for something to really unwind a knot and sustain in one area, I'd go with a model that you can dictate when it changes direction.\n-Ball pressure: I find I have a really hard time getting it in a position that doesn't dig TOO hard, or not hard enough. So it's a bit cumbersome and time consuming. For me it's not enough to just lean lightly against a chair and have it pushing on my back. It pokes in weird areas. I find it hard to relax into it unless I find the right spot. When I do, it's nice! But it's like 75% of the time I'm messing with it to get the pressure right. This to me is more about this kind of massager, rather than this specific model. Live and learn!\n-I find the simple way it works is sometimes nice and effective, but overall feels a bit monotonous. Someone mentioned in a review that it's not like a nail salon massage chair and I unfortunately find that it's quite similar to those. Just kinda pushes on you and unless you get the right spot. Again, when I have found good spots it's very nice! So far no lasting relief - I got this for painful shoulder and neck issues and I haven't noticed drastic differences, but nothing worse. I also thought it would help my lower back which gets sore or my hips, and it's not had any major results but we shall see.\n\nSo I don't find it as AMAZING like some little human robot hands as i was secretly dreaming of, but it's certainly nice to have around the house. It's just an \"additional massager\" like if I want a \"general rub down\" somewhere without expecting miracles, and if I can get the hang of where to position it on my wall/chair/couch/body.... but I think I'll have to buy something more detailed with more features for speed or pressure for my main, more painful muscle issues.\n\nBut if you are looking for a simple, 2-way rotational massager to just plug away on one spot for 20 minutes and you don't need as much nuance as me, this is well made! Comes with a nice little slipcover for use with heat.",
    "reviewer_name": "Jamie",
    "review_date": "April 6, 2020",
    "verified_purchase": true,
    "helpful_count": 44
  },
  {
    "review_id": "RIAUIZISKCHA8",
    "rating": 5,
    "review_title": "",
    "review_body": "We've had the Zyllion Shiatsu massager for going on 5 years now. Really the only complaint is that over that time, the exterior fabric started to wear out and made it so we didn't really want to use it anymore. One quick email to customer service and they sent a replacement after we shared them the extent of the wear and tear and a day later there was a USPS notification of a package coming to us. Hopefully going to get another 5 years out of this. I do wish you could control the switching of direction but otherwise, this is a really useful massager that brings us a ton of relief.",
    "reviewer_name": "ethan",
    "review_date": "November 19, 2025",
    "verified_purchase": true,
    "helpful_count": 0
  },
  {
    "review_id": "RUF4WUKMH7G3C",
    "rating": 5,
    "review_title": "",
    "review_body": "UPDATE -- Aug 22, 2017\nWell, Zyllion did exactly as promised. As noted below, the same day I emailed them they responded, and mailed me the replacement with a tracking number. Well, on Friday, Aug 18, I had the replacement cover!!\n\nI'll just quote from the email I just sent them, of course via the Amazon contact seller system (which itself is a fantastic system, since Amazon thus can supervise the communication process in case there are problems, and prevent a seller from getting away with spam, phishing, etc.)\n\n\"Just wanted you to know that I received the replacement cover, and have already replaced the damaged one. I was blown away by how easy it was to do so. Even for this not-as mechanically involved person, I saw simple details, especially in the manner in which the switch is built, which made replacing the cover a piece of cake.\n\"The manner in which you have taken care of this issue for me has thoroughly cemented my relationship with your company and this product. Should I need any other product, I now know where to get it.\n\"Thank you for demonstrating that there still are companies who truly are consumer oriented, and even go beyond what one might normally expect. What a breath of fresh air this experience has been to me.\"\n\nFew companies have earned that kind of respect from me, and most are giants of commerce, from American Express, Lenovo (ThinkPads), Samsung (smartphones) to State Farm (though of late my loyalties with the flatter have waivered); to mid-size companies like Ameriprise Financial, the largest of the bona fide financial planning firms in the country (full disclosure here--I was a board certified financial advisor with them for 25 years, until I retired early 2016; I worked for them that long because I wanted to do personal financial planning with clients, and I was able to do just that with their full backing and support), CareFirst (a BC & BS health insurance company serving MD, DC and northern VA) and Sprint.\n\nWell, now Zyllion has been added to that list! Thank you, Zyllion!!!\n\nUPDATE -- Aug 16, 2017\nI initially gave a 5 star review after purchasing my \"Zyllion ZMA13BK Shiatsu Pillow Massager with Heat\" two years ago. At the time I was still working as a personal financial advisor (25 years) out of my home office. Since I've had lower back pain for a long time, I've used various \"Shiatsu\" type massagers, including a full back and seat device (this last one had very limited benefits, even though it cost me an arm and a leg.\n\nWell, initially I would often use it off and on much of my work day, which was mostly desk bound (I had clients scattered up and down the east coast, with a heavy concentration in SW Florida, and a smaller exposure here in western Maryland, who had been with me for a long time, so much of the work was done by phone and online, though I still scheduled face-to-face meetings in my clients' homes, including an yearly trip to Florida).\n\nAnd oh did it feel great. I especially loved these features:\n~~ The heat setting!!\n~~ Regularly changes directions.\n~~ The controls couldn't be easier.\n~~ Very compact, making it easier to move around (see next comment)\n~~ And very light, so makes it easier to move around my mid to lower back.\n\nIn many ways, the best was yet to come. Not so much that for the last year or so I'm about 90% retired (for chronic daily migraines--23 years)--yes, that has helped things a whole lot. Thus I don't sit with our computer by our office desk like in the past--no more than about 1-2 hrs/day. But when I do, it is so nice to have my Zyllion Shiatsu Massager. Unfortunately, a tear began to develop on the fabric mesh cover.\n\nI figured that's the way it is (since it was beyond the 1-yr warranty period), so I continued to use it, but only when I absolutely needed it badly. Slowly the tear became bigger. I tried to solution that all men have for any of life's problems--good old duct tape!! Except that, not surprisingly, the moving \"rollers ball-like massagers\" would briefly get caught in the adhesive of the exposed duct tape.\nThen I noticed that there is a zipper which goes nearly all the way around the massager housing. I unzipped it, and figured I could place some duct take on the inside, and this way \"protect\" the adhesive on the outside. No doing, since there is constant friction between the rollers. (I'm sure you engineering brains out there would have predicted all this, but I'm a past preacher and financial advisor, not a mechanical engineer.)\n\nBy the way, I was way impressed by the simplicity of design and the semi-rigid and yet soft \"housing\" all around the motor and the two sets of moving rollers. Since I was \"defeated\" in my homemade solutions, I decided to look around the link to the product, and see if I could find anything of help. I was once again impressed by the very high numbers of highly satisfied customers, like myself.\n\nThen I noticed a statement in one of the photos, which I've attached. It stated, \"Free Replacement Cover Service.\" I just about fell off my chair. So I decided to recheck the questions section, to see if anyone else had run into this problem. Sure enough, and the response from Zyllion had been quite fast, as in this answer to a certain Carlo D., who asked, just less than 2 weeks ago, on Friday, August 4, 2017—\n\n\"I need to replace the cover please help\"\n\nZyllion Customer Service immediately responded the very next business day, Monday August 7, 2017—\n\n\"Dear Carlo:\n\"Thank you for your comment!\n\"We will gladly ship to you a brand new replacement cover at no additional cost.\"\n\nI almost fell off my chair a second time. So I immediately wrote to them, sending my message using the Amazon internal system of communicating with a vendor, shortly after midnight TODAY (12:30 am EDT). By 12:07 pm EDT, not quite 12 hours after writing to them, I had an answer from them, saying that they would indeed send me a replacement cover; they just needed my address.\n\nWhile writing this, here at 3:17 pm EDT, they already put my replacement cover in the mail to me, with a tracking number from the USPS.\n\nThey closed that response with the following, \"Please contact us with any further questions or concerns. At Zyllion, your complete customer satisfaction is our #1 priority.\"\n\nWell, plenty of companies will say that \"customer satisfaction is our #1 priority.\" Hogwash. That's just fancy talk which is rarely delivered in my experience (I'll soon turn 65, so I've been in this game for a long time). Except for a few exceptional companies like American Express, and now I've added Amazon to that list (I've been a client now for 19 years!!!), it is mostly just talk.\n\nZYLLION IS NOT JUST TALK. THEY DELIVER. With an exceptional product. And I can now add, EXCEPTIONAL SERVICE!!! Thank you, thank you, thank you. I'll be singing your praises near and far from now on!!!",
    "reviewer_name": "Marcus",
    "review_date": "August 16, 2017",
    "verified_purchase": true,
    "helpful_count": 166
  },
  {
    "review_id": "R2HAJ56T8JAXMW",
    "rating": 5,
    "review_title": "",
    "review_body": "We bought this massager back in 2018 and it just now started getting tears in it’s cover. Not only that but it has with stood all these years!! 7 YEARS!! Of a 6’4” 250lb man laying on it every night!! I don’t mean resting a leg or sitting back. I mean he puts it in the bad and lays on it btw his shoulder blades and neck. AND, he falls asleep w it, laying on it for the majority of the night. It has never once stalled, shorted out or quit in 7 years! If that doesn’t speak volumes I don’t know what does.\nThe other night he let me know the cover had finally torn so much and he could no longer use it. It still worked perfectly but you need the cover for safety. I got on Amazon and was about to order him another one and thought I would read the reviews and see if anyone else had one as long as we have. Upon reading all the reviews this machine seems to be highly valued by so many!! I also found other people updating their review to say that they reached out to the company and let them know they had the same problem as I did, they just needed a cover. I read where this company would send replacement covers!! FOR FREE!! I thought there is no way. I sent them an email and I got a response back within 24 hrs saying they would be glad to send me a FREE cover if I sent them a photo of our massager. I did and they said the new cover was on the way. It showed up a few days later and was easy to put on and this thing is as good as new!!",
    "reviewer_name": "Patricia Chrestman",
    "review_date": "October 20, 2025",
    "verified_purchase": true,
    "helpful_count": 12
  },
  {
    "review_id": "R1HFGU6PSH9UWV",
    "rating": 5,
    "review_title": "",
    "review_body": "I bought this exact same very powerful device about 10 years ago and it lasted about 3 years. The motor is still good but the cloth wore out and because a pillow case works OK, but is not perfect, I decided to buy another one. It is a miracle for my lower back and does not bog down the motor when I lay on it with all my weight. It's a very powerful motor and I highly recommend this product. DO NOT waste your money on cheap knock-offs. There are none that compare to the overall high quality of this high-performance massager.",
    "reviewer_name": "USFreedom2025-Q",
    "review_date": "November 3, 2025",
    "verified_purchase": true,
    "helpful_count": 7
  },
  {
    "review_id": "R2RMKWKP71QM7U",
    "rating": 5,
    "review_title": "",
    "review_body": "I purchased this product in the fall of 2022 and have had it for 2 and 1/2 years now. I love it! It is so effective and so easy to use. I have a dedicated chair in my room that it stays in, but I can easily take it downstairs to the couch and have it be just as effective. I struggle with a lot of muscle tension, and the option for heat or no heat is so great. It would be nice if it could have some additional settings, but I don't really need it. Not when it's such a dependable worker. I've used it for an hour straight and it still works even when I'm leaning on it. I'm only about 150. But I have other massagers that won't even make it the full 15 or 20 minutes they say that they're supposed to do if I relax against it. This thing is strong and gets the job done! And the heat really lets your muscles relax a little more so the kneading can do its job. I love this thing so much that I've bought a few more to give as gifts to friends. And I like that since it is small it is easy to move from my lower back to my middle back to shoulders. Without having a big heavy chair that's dedicated. Love this little guy!",
    "reviewer_name": "Gorilla Quandary",
    "review_date": "February 20, 2025",
    "verified_purchase": true,
    "helpful_count": 11
  },
  {
    "review_id": "R2WHYO8MAGURJ4",
    "rating": 4,
    "review_title": "",
    "review_body": "This massager works amazingly.. it will kneed deep into your back with non-painful upward and downward compressing pressure. (Like how a masseuse would use their thumbs to circle toward each other) It has heated or non-headed mode, and when the cover wore out (which is inevitable because of the friction created by the kneeding), Zyllion promptly honored the year warranty and mailed me a new cover USPS express. For $40, it's hard not to give this massager 5 stars, however, there are a couple notable flaws which keep it from being an unbelievable deal.\nThe Cons:\n**As mentioned previously, the friction from the kneeding makes it inevitable that the stitching joining materials will be torn. It did, however, take 3-4 months of heavy use (and I'm a 280# guy) before the stitching gave way, so I feel I got my value out of the product. The fact that they replaced the cover so that I will get even more life out of the product is great! Incidentally, I tried sewing a cotton patch to repair the cover myself, however, any material other than a slick nylon/polyester catches on the wheels, and gets twisted into oblivion.\n**When not run in heating mode, the unit can operate fairly indefinitely, though it will gradually heat up from use.\n**When run in heating mode, the unit can run for 3-4 consecutive cycles (a cycle seems to take a couple minutes) before overheating and needing to be left alone for a bit.\n**the quick disconnect is more of an inevitable disconnect. It makes the unit close to unusable, except that you can wrap it around the elastic band so it doesn't pull free. Placing the pillow against a chair for using it will often work the quick disconnect free.\n\nThe Pros:\n** Works amazing! Use it for your lower or upper back, your neck, your thighs or your calves.. the kneeding effect is useful anywhere you can create opposing pressure against the pillow. Works well enough that I hear the occassional pop as my joints loosen up, and my back usually cracks after use. I'd estimate the pillow can handle about 10 lbs of pressure before the motor starts to object. This means if put it on the ground and lay with your back on it, you'll probably slow down, and shorten the life of, the motor.. but if you prop yourself with pillows or foam roller to alleviate the pressure...\n** Has heated or non-heated mode. The heat really helps to work out the kinks, particularly if it's cold out.\n** Really compact. Smaller than most pillows, though not at all squishy.\n** Can run virtually non-stop when not running in heat mode.\n** Can run in both car and home, and, I feel, makes driving more comfortable as it provides lower back support helping me sit upright.",
    "reviewer_name": "Critical Insights",
    "review_date": "June 20, 2018",
    "verified_purchase": true,
    "helpful_count": 27
  },
  {
    "review_id": "R3TW9R1VFZ6E0E",
    "rating": 5,
    "review_title": "",
    "review_body": "The massager is very sturdy and quite strong with the rotating heads massaging and continuing to spin despite weight put on it, while lying down on it or putting a leg or whole body side onto it. My wife loves it and uses it the most, and this is our second one, same model.\n\nThere is a problem with the wiring fraying with repetitive use or its having on-off-on again connectivity issues. I wrapped the wire around the insulation with additional wire wrap near the wire going into the device, the connector parts, and it’s working better, it seems. I did this right after unboxing after the 1-year (warranty extended to 2-year) warranty replacement. The warranty replacement went smoothly, the operator friendly, nice.\n\nOther than the wiring, great product. Great price point too, although we’ve used and have owned much more expensive massagers, my wife keeps using this one and asked for the same make, model, despite my offering to buy her a more high-end one. She says it’s easier to use while on the sofa watching tv or doing work at home.",
    "reviewer_name": "Steven Huh",
    "review_date": "November 6, 2025",
    "verified_purchase": true,
    "helpful_count": 3
  },
  {
    "review_id": "R2HMFLQFW69006",
    "rating": 5,
    "review_title": "",
    "review_body": "As as senior I recently suffered from a fall that injured my lower back muscles. A physical therapist told me I needed myofascial release therapy. It is a manual therapy that uses gentle, sustained pressure to release restrictions in the fascia, the connective tissue that surrounds and supports muscles, bones, and organs. This hands-on technique aims to alleviate pain, stiffness, and dysfunction caused by tight or restricted fascia. It can be used to treat a wide range of conditions, including back and neck pain, fibromyalgia, and sports injuries, with benefits such as increased range of motion and reduced pain.  I tried to find that therapy locally. Cost was 60-80 dollars for 30 minutes. I bought this item and I have used it three times already. It is amazing with it's soothing results. The heat is very comfortable. It has already paid for itself.",
    "reviewer_name": "Pubtym",
    "review_date": "November 8, 2025",
    "verified_purchase": true,
    "helpful_count": 2
  },
  {
    "review_id": "RYY1VU0SNCD7E",
    "rating": 5,
    "review_title": "",
    "review_body": "I love this product and have suggested it to my family and friends with back pain and they have had the same wonderful experience. It works incredibly well and a natural remedy without pain meds or expensive PT. On top of that, the best customer service I have ever experienced.\nI highly recommend this company and products.",
    "reviewer_name": "HM",
    "review_date": "November 3, 2025",
    "verified_purchase": true,
    "helpful_count": 3
  },
  {
    "review_id": "R3N6UEYPR1CN34",
    "rating": 3,
    "review_title": "",
    "review_body": "I'm right in the middle for this little massager. I researched a bunch and this one seemed to have the best reviews, but I'm just a little disappointed for my needs and might get something else.\n\nPROS\n-Holds up well to pressure! I really try to dig into certain places and so far, after about 5 uses, it's still working, doesn't stop, and keeps massaging. I like that a lot. It goes a bit slower sometimes but I trust it will keep going.\n-Heat is really nice and soothing and not too hot. Be warned, however, I was pressing hard on my bare skin and got a bit chafed on the heat setting because I was digging into the skin. It wouldn't do that normally, though, it was the way I was using it. Overall the heat is mild and a perfect temp.\n-Light and has a long cord, fairly easy to move around.\n-Has given me some occasional relief when I've been able to get the right position, for a good night sleep.\n-I have had some luck around the lower/mid-neck, even though it's not designed for that. I just move it so one side gets the area I want, which feels good. But overall this is a bit too wide to give a nice \"squeeze\" to the neck. I'm small, 5'4\" and 125 so if you are bigger with a bigger neck this would maybe be great!\n\nCONS\n-The directional-switch of the motors is automatic. It's nice sometimes, but I think I'd prefer to be able to control when the rotation switches direction. Often I will be in a sweet spot and it will change and then I'll have to adjust a bit. Nothing terrible but if you are looking for something to really unwind a knot and sustain in one area, I'd go with a model that you can dictate when it changes direction.\n-Ball pressure: I find I have a really hard time getting it in a position that doesn't dig TOO hard, or not hard enough. So it's a bit cumbersome and time consuming. For me it's not enough to just lean lightly against a chair and have it pushing on my back. It pokes in weird areas. I find it hard to relax into it unless I find the right spot. When I do, it's nice! But it's like 75% of the time I'm messing with it to get the pressure right. This to me is more about this kind of massager, rather than this specific model. Live and learn!\n-I find the simple way it works is sometimes nice and effective, but overall feels a bit monotonous. Someone mentioned in a review that it's not like a nail salon massage chair and I unfortunately find that it's quite similar to those. Just kinda pushes on you and unless you get the right spot. Again, when I have found good spots it's very nice! So far no lasting relief - I got this for painful shoulder and neck issues and I haven't noticed drastic differences, but nothing worse. I also thought it would help my lower back which gets sore or my hips, and it's not had any major results but we shall see.\n\nSo I don't find it as AMAZING like some little human robot hands as i was secretly dreaming of, but it's certainly nice to have around the house. It's just an \"additional massager\" like if I want a \"general rub down\" somewhere without expecting miracles, and if I can get the hang of where to position it on my wall/chair/couch/body.... but I think I'll have to buy something more detailed with more features for speed or pressure for my main, more painful muscle issues.\n\nBut if you are looking for a simple, 2-way rotational massager to just plug away on one spot for 20 minutes and you don't need as much nuance as me, this is well made! Comes with a nice little slipcover for use with heat.",
    "reviewer_name": "Jamie",
    "review_date": "April 6, 2020",
    "verified_purchase": true,
    "helpful_count": 44
  },
  {
    "review_id": "RIAUIZISKCHA8",
    "rating": 5,
    "review_title": "",
    "review_body": "We've had the Zyllion Shiatsu massager for going on 5 years now. Really the only complaint is that over that time, the exterior fabric started to wear out and made it so we didn't really want to use it anymore. One quick email to customer service and they sent a replacement after we shared them the extent of the wear and tear and a day later there was a USPS notification of a package coming to us. Hopefully going to get another 5 years out of this. I do wish you could control the switching of direction but otherwise, this is a really useful massager that brings us a ton of relief.",
    "reviewer_name": "ethan",
    "review_date": "November 19, 2025",
    "verified_purchase": true,
    "helpful_count": 0
  },
  {
    "review_id": "RUF4WUKMH7G3C",
    "rating": 5,
    "review_title": "",
    "review_body": "UPDATE -- Aug 22, 2017\nWell, Zyllion did exactly as promised. As noted below, the same day I emailed them they responded, and mailed me the replacement with a tracking number. Well, on Friday, Aug 18, I had the replacement cover!!\n\nI'll just quote from the email I just sent them, of course via the Amazon contact seller system (which itself is a fantastic system, since Amazon thus can supervise the communication process in case there are problems, and prevent a seller from getting away with spam, phishing, etc.)\n\n\"Just wanted you to know that I received the replacement cover, and have already replaced the damaged one. I was blown away by how easy it was to do so. Even for this not-as mechanically involved person, I saw simple details, especially in the manner in which the switch is built, which made replacing the cover a piece of cake.\n\"The manner in which you have taken care of this issue for me has thoroughly cemented my relationship with your company and this product. Should I need any other product, I now know where to get it.\n\"Thank you for demonstrating that there still are companies who truly are consumer oriented, and even go beyond what one might normally expect. What a breath of fresh air this experience has been to me.\"\n\nFew companies have earned that kind of respect from me, and most are giants of commerce, from American Express, Lenovo (ThinkPads), Samsung (smartphones) to State Farm (though of late my loyalties with the flatter have waivered); to mid-size companies like Ameriprise Financial, the largest of the bona fide financial planning firms in the country (full disclosure here--I was a board certified financial advisor with them for 25 years, until I retired early 2016; I worked for them that long because I wanted to do personal financial planning with clients, and I was able to do just that with their full backing and support), CareFirst (a BC & BS health insurance company serving MD, DC and northern VA) and Sprint.\n\nWell, now Zyllion has been added to that list! Thank you, Zyllion!!!\n\nUPDATE -- Aug 16, 2017\nI initially gave a 5 star review after purchasing my \"Zyllion ZMA13BK Shiatsu Pillow Massager with Heat\" two years ago. At the time I was still working as a personal financial advisor (25 years) out of my home office. Since I've had lower back pain for a long time, I've used various \"Shiatsu\" type massagers, including a full back and seat device (this last one had very limited benefits, even though it cost me an arm and a leg.\n\nWell, initially I would often use it off and on much of my work day, which was mostly desk bound (I had clients scattered up and down the east coast, with a heavy concentration in SW Florida, and a smaller exposure here in western Maryland, who had been with me for a long time, so much of the work was done by phone and online, though I still scheduled face-to-face meetings in my clients' homes, including an yearly trip to Florida).\n\nAnd oh did it feel great. I especially loved these features:\n~~ The heat setting!!\n~~ Regularly changes directions.\n~~ The controls couldn't be easier.\n~~ Very compact, making it easier to move around (see next comment)\n~~ And very light, so makes it easier to move around my mid to lower back.\n\nIn many ways, the best was yet to come. Not so much that for the last year or so I'm about 90% retired (for chronic daily migraines--23 years)--yes, that has helped things a whole lot. Thus I don't sit with our computer by our office desk like in the past--no more than about 1-2 hrs/day. But when I do, it is so nice to have my Zyllion Shiatsu Massager. Unfortunately, a tear began to develop on the fabric mesh cover.\n\nI figured that's the way it is (since it was beyond the 1-yr warranty period), so I continued to use it, but only when I absolutely needed it badly. Slowly the tear became bigger. I tried to solution that all men have for any of life's problems--good old duct tape!! Except that, not surprisingly, the moving \"rollers ball-like massagers\" would briefly get caught in the adhesive of the exposed duct tape.\nThen I noticed that there is a zipper which goes nearly all the way around the massager housing. I unzipped it, and figured I could place some duct take on the inside, and this way \"protect\" the adhesive on the outside. No doing, since there is constant friction between the rollers. (I'm sure you engineering brains out there would have predicted all this, but I'm a past preacher and financial advisor, not a mechanical engineer.)\n\nBy the way, I was way impressed by the simplicity of design and the semi-rigid and yet soft \"housing\" all around the motor and the two sets of moving rollers. Since I was \"defeated\" in my homemade solutions, I decided to look around the link to the product, and see if I could find anything of help. I was once again impressed by the very high numbers of highly satisfied customers, like myself.\n\nThen I noticed a statement in one of the photos, which I've attached. It stated, \"Free Replacement Cover Service.\" I just about fell off my chair. So I decided to recheck the questions section, to see if anyone else had run into this problem. Sure enough, and the response from Zyllion had been quite fast, as in this answer to a certain Carlo D., who asked, just less than 2 weeks ago, on Friday, August 4, 2017—\n\n\"I need to replace the cover please help\"\n\nZyllion Customer Service immediately responded the very next business day, Monday August 7, 2017—\n\n\"Dear Carlo:\n\"Thank you for your comment!\n\"We will gladly ship to you a brand new replacement cover at no additional cost.\"\n\nI almost fell off my chair a second time. So I immediately wrote to them, sending my message using the Amazon internal system of communicating with a vendor, shortly after midnight TODAY (12:30 am EDT). By 12:07 pm EDT, not quite 12 hours after writing to them, I had an answer from them, saying that they would indeed send me a replacement cover; they just needed my address.\n\nWhile writing this, here at 3:17 pm EDT, they already put my replacement cover in the mail to me, with a tracking number from the USPS.\n\nThey closed that response with the following, \"Please contact us with any further questions or concerns. At Zyllion, your complete customer satisfaction is our #1 priority.\"\n\nWell, plenty of companies will say that \"customer satisfaction is our #1 priority.\" Hogwash. That's just fancy talk which is rarely delivered in my experience (I'll soon turn 65, so I've been in this game for a long time). Except for a few exceptional companies like American Express, and now I've added Amazon to that list (I've been a client now for 19 years!!!), it is mostly just talk.\n\nZYLLION IS NOT JUST TALK. THEY DELIVER. With an exceptional product. And I can now add, EXCEPTIONAL SERVICE!!! Thank you, thank you, thank you. I'll be singing your praises near and far from now on!!!",
    "reviewer_name": "Marcus",
    "review_date": "August 16, 2017",
    "verified_purchase": true,
    "helpful_count": 166
  },
  {
    "review_id": "R2HAJ56T8JAXMW",
    "rating": 5,
    "review_title": "",
    "review_body": "We bought this massager back in 2018 and it just now started getting tears in it’s cover. Not only that but it has with stood all these years!! 7 YEARS!! Of a 6’4” 250lb man laying on it every night!! I don’t mean resting a leg or sitting back. I mean he puts it in the bad and lays on it btw his shoulder blades and neck. AND, he falls asleep w it, laying on it for the majority of the night. It has never once stalled, shorted out or quit in 7 years! If that doesn’t speak volumes I don’t know what does.\nThe other night he let me know the cover had finally torn so much and he could no longer use it. It still worked perfectly but you need the cover for safety. I got on Amazon and was about to order him another one and thought I would read the reviews and see if anyone else had one as long as we have. Upon reading all the reviews this machine seems to be highly valued by so many!! I also found other people updating their review to say that they reached out to the company and let them know they had the same problem as I did, they just needed a cover. I read where this company would send replacement covers!! FOR FREE!! I thought there is no way. I sent them an email and I got a response back within 24 hrs saying they would be glad to send me a FREE cover if I sent them a photo of our massager. I did and they said the new cover was on the way. It showed up a few days later and was easy to put on and this thing is as good as new!!",
    "reviewer_name": "Patricia Chrestman",
    "review_date": "October 20, 2025",
    "verified_purchase": true,
    "helpful_count": 12
  },
  {
    "review_id": "R1HFGU6PSH9UWV",
    "rating": 5,
    "review_title": "",
    "review_body": "I bought this exact same very powerful device about 10 years ago and it lasted about 3 years. The motor is still good but the cloth wore out and because a pillow case works OK, but is not perfect, I decided to buy another one. It is a miracle for my lower back and does not bog down the motor when I lay on it with all my weight. It's a very powerful motor and I highly recommend this product. DO NOT waste your money on cheap knock-offs. There are none that compare to the overall high quality of this high-performance massager.",
    "reviewer_name": "USFreedom2025-Q",
    "review_date": "November 3, 2025",
    "verified_purchase": true,
    "helpful_count": 7
  },
  {
    "review_id": "R2RMKWKP71QM7U",
    "rating": 5,
    "review_title": "",
    "review_body": "I purchased this product in the fall of 2022 and have had it for 2 and 1/2 years now. I love it! It is so effective and so easy to use. I have a dedicated chair in my room that it stays in, but I can easily take it downstairs to the couch and have it be just as effective. I struggle with a lot of muscle tension, and the option for heat or no heat is so great. It would be nice if it could have some additional settings, but I don't really need it. Not when it's such a dependable worker. I've used it for an hour straight and it still works even when I'm leaning on it. I'm only about 150. But I have other massagers that won't even make it the full 15 or 20 minutes they say that they're supposed to do if I relax against it. This thing is strong and gets the job done! And the heat really lets your muscles relax a little more so the kneading can do its job. I love this thing so much that I've bought a few more to give as gifts to friends. And I like that since it is small it is easy to move from my lower back to my middle back to shoulders. Without having a big heavy chair that's dedicated. Love this little guy!",
    "reviewer_name": "Gorilla Quandary",
    "review_date": "February 20, 2025",
    "verified_purchase": true,
    "helpful_count": 11
  },
  {
    "review_id": "R2WHYO8MAGURJ4",
    "rating": 4,
    "review_title": "",
    "review_body": "This massager works amazingly.. it will kneed deep into your back with non-painful upward and downward compressing pressure. (Like how a masseuse would use their thumbs to circle toward each other) It has heated or non-headed mode, and when the cover wore out (which is inevitable because of the friction created by the kneeding), Zyllion promptly honored the year warranty and mailed me a new cover USPS express. For $40, it's hard not to give this massager 5 stars, however, there are a couple notable flaws which keep it from being an unbelievable deal.\nThe Cons:\n**As mentioned previously, the friction from the kneeding makes it inevitable that the stitching joining materials will be torn. It did, however, take 3-4 months of heavy use (and I'm a 280# guy) before the stitching gave way, so I feel I got my value out of the product. The fact that they replaced the cover so that I will get even more life out of the product is great! Incidentally, I tried sewing a cotton patch to repair the cover myself, however, any material other than a slick nylon/polyester catches on the wheels, and gets twisted into oblivion.\n**When not run in heating mode, the unit can operate fairly indefinitely, though it will gradually heat up from use.\n**When run in heating mode, the unit can run for 3-4 consecutive cycles (a cycle seems to take a couple minutes) before overheating and needing to be left alone for a bit.\n**the quick disconnect is more of an inevitable disconnect. It makes the unit close to unusable, except that you can wrap it around the elastic band so it doesn't pull free. Placing the pillow against a chair for using it will often work the quick disconnect free.\n\nThe Pros:\n** Works amazing! Use it for your lower or upper back, your neck, your thighs or your calves.. the kneeding effect is useful anywhere you can create opposing pressure against the pillow. Works well enough that I hear the occassional pop as my joints loosen up, and my back usually cracks after use. I'd estimate the pillow can handle about 10 lbs of pressure before the motor starts to object. This means if put it on the ground and lay with your back on it, you'll probably slow down, and shorten the life of, the motor.. but if you prop yourself with pillows or foam roller to alleviate the pressure...\n** Has heated or non-heated mode. The heat really helps to work out the kinks, particularly if it's cold out.\n** Really compact. Smaller than most pillows, though not at all squishy.\n** Can run virtually non-stop when not running in heat mode.\n** Can run in both car and home, and, I feel, makes driving more comfortable as it provides lower back support helping me sit upright.",
    "reviewer_name": "Critical Insights",
    "review_date": "June 20, 2018",
    "verified_purchase": true,
    "helpful_count": 27
  },
  {
    "review_id": "R3TW9R1VFZ6E0E",
    "rating": 5,
    "review_title": "",
    "review_body": "The massager is very sturdy and quite strong with the rotating heads massaging and continuing to spin despite weight put on it, while lying down on it or putting a leg or whole body side onto it. My wife loves it and uses it the most, and this is our second one, same model.\n\nThere is a problem with the wiring fraying with repetitive use or its having on-off-on again connectivity issues. I wrapped the wire around the insulation with additional wire wrap near the wire going into the device, the connector parts, and it’s working better, it seems. I did this right after unboxing after the 1-year (warranty extended to 2-year) warranty replacement. The warranty replacement went smoothly, the operator friendly, nice.\n\nOther than the wiring, great product. Great price point too, although we’ve used and have owned much more expensive massagers, my wife keeps using this one and asked for the same make, model, despite my offering to buy her a more high-end one. She says it’s easier to use while on the sofa watching tv or doing work at home.",
    "reviewer_name": "Steven Huh",
    "review_date": "November 6, 2025",
    "verified_purchase": true,
    "helpful_count": 3
  },
  {
    "review_id": "R2HMFLQFW69006",
    "rating": 5,
    "review_title": "",
    "review_body": "As as senior I recently suffered from a fall that injured my lower back muscles. A physical therapist told me I needed myofascial release therapy. It is a manual therapy that uses gentle, sustained pressure to release restrictions in the fascia, the connective tissue that surrounds and supports muscles, bones, and organs. This hands-on technique aims to alleviate pain, stiffness, and dysfunction caused by tight or restricted fascia. It can be used to treat a wide range of conditions, including back and neck pain, fibromyalgia, and sports injuries, with benefits such as increased range of motion and reduced pain.  I tried to find that therapy locally. Cost was 60-80 dollars for 30 minutes. I bought this item and I have used it three times already. It is amazing with it's soothing results. The heat is very comfortable. It has already paid for itself.",
    "reviewer_name": "Pubtym",
    "review_date": "November 8, 2025",
    "verified_purchase": true,
    "helpful_count": 2
  },
  {
    "review_id": "RYY1VU0SNCD7E",
    "rating": 5,
    "review_title": "",
    "review_body": "I love this product and have suggested it to my family and friends with back pain and they have had the same wonderful experience. It works incredibly well and a natural remedy without pain meds or expensive PT. On top of that, the best customer service I have ever experienced.\nI highly recommend this company and products.",
    "reviewer_name": "HM",
    "review_date": "November 3, 2025",
    "verified_purchase": true,
    "helpful_count": 3
  },
  {
    "review_id": "R3N6UEYPR1CN34",
    "rating": 3,
    "review_title": "",
    "review_body": "I'm right in the middle for this little massager. I researched a bunch and this one seemed to have the best reviews, but I'm just a little disappointed for my needs and might get something else.\n\nPROS\n-Holds up well to pressure! I really try to dig into certain places and so far, after about 5 uses, it's still working, doesn't stop, and keeps massaging. I like that a lot. It goes a bit slower sometimes but I trust it will keep going.\n-Heat is really nice and soothing and not too hot. Be warned, however, I was pressing hard on my bare skin and got a bit chafed on the heat setting because I was digging into the skin. It wouldn't do that normally, though, it was the way I was using it. Overall the heat is mild and a perfect temp.\n-Light and has a long cord, fairly easy to move around.\n-Has given me some occasional relief when I've been able to get the right position, for a good night sleep.\n-I have had some luck around the lower/mid-neck, even though it's not designed for that. I just move it so one side gets the area I want, which feels good. But overall this is a bit too wide to give a nice \"squeeze\" to the neck. I'm small, 5'4\" and 125 so if you are bigger with a bigger neck this would maybe be great!\n\nCONS\n-The directional-switch of the motors is automatic. It's nice sometimes, but I think I'd prefer to be able to control when the rotation switches direction. Often I will be in a sweet spot and it will change and then I'll have to adjust a bit. Nothing terrible but if you are looking for something to really unwind a knot and sustain in one area, I'd go with a model that you can dictate when it changes direction.\n-Ball pressure: I find I have a really hard time getting it in a position that doesn't dig TOO hard, or not hard enough. So it's a bit cumbersome and time consuming. For me it's not enough to just lean lightly against a chair and have it pushing on my back. It pokes in weird areas. I find it hard to relax into it unless I find the right spot. When I do, it's nice! But it's like 75% of the time I'm messing with it to get the pressure right. This to me is more about this kind of massager, rather than this specific model. Live and learn!\n-I find the simple way it works is sometimes nice and effective, but overall feels a bit monotonous. Someone mentioned in a review that it's not like a nail salon massage chair and I unfortunately find that it's quite similar to those. Just kinda pushes on you and unless you get the right spot. Again, when I have found good spots it's very nice! So far no lasting relief - I got this for painful shoulder and neck issues and I haven't noticed drastic differences, but nothing worse. I also thought it would help my lower back which gets sore or my hips, and it's not had any major results but we shall see.\n\nSo I don't find it as AMAZING like some little human robot hands as i was secretly dreaming of, but it's certainly nice to have around the house. It's just an \"additional massager\" like if I want a \"general rub down\" somewhere without expecting miracles, and if I can get the hang of where to position it on my wall/chair/couch/body.... but I think I'll have to buy something more detailed with more features for speed or pressure for my main, more painful muscle issues.\n\nBut if you are looking for a simple, 2-way rotational massager to just plug away on one spot for 20 minutes and you don't need as much nuance as me, this is well made! Comes with a nice little slipcover for use with heat.",
    "reviewer_name": "Jamie",
    "review_date": "April 6, 2020",
    "verified_purchase": true,
    "helpful_count": 44
  },
  {
    "review_id": "RIAUIZISKCHA8",
    "rating": 5,
    "review_title": "",
    "review_body": "We've had the Zyllion Shiatsu massager for going on 5 years now. Really the only complaint is that over that time, the exterior fabric started to wear out and made it so we didn't really want to use it anymore. One quick email to customer service and they sent a replacement after we shared them the extent of the wear and tear and a day later there was a USPS notification of a package coming to us. Hopefully going to get another 5 years out of this. I do wish you could control the switching of direction but otherwise, this is a really useful massager that brings us a ton of relief.",
    "reviewer_name": "ethan",
    "review_date": "November 19, 2025",
    "verified_purchase": true,
    "helpful_count": 0
  },
  {
    "review_id": "RUF4WUKMH7G3C",
    "rating": 5,
    "review_title": "",
    "review_body": "UPDATE -- Aug 22, 2017\nWell, Zyllion did exactly as promised. As noted below, the same day I emailed them they responded, and mailed me the replacement with a tracking number. Well, on Friday, Aug 18, I had the replacement cover!!\n\nI'll just quote from the email I just sent them, of course via the Amazon contact seller system (which itself is a fantastic system, since Amazon thus can supervise the communication process in case there are problems, and prevent a seller from getting away with spam, phishing, etc.)\n\n\"Just wanted you to know that I received the replacement cover, and have already replaced the damaged one. I was blown away by how easy it was to do so. Even for this not-as mechanically involved person, I saw simple details, especially in the manner in which the switch is built, which made replacing the cover a piece of cake.\n\"The manner in which you have taken care of this issue for me has thoroughly cemented my relationship with your company and this product. Should I need any other product, I now know where to get it.\n\"Thank you for demonstrating that there still are companies who truly are consumer oriented, and even go beyond what one might normally expect. What a breath of fresh air this experience has been to me.\"\n\nFew companies have earned that kind of respect from me, and most are giants of commerce, from American Express, Lenovo (ThinkPads), Samsung (smartphones) to State Farm (though of late my loyalties with the flatter have waivered); to mid-size companies like Ameriprise Financial, the largest of the bona fide financial planning firms in the country (full disclosure here--I was a board certified financial advisor with them for 25 years, until I retired early 2016; I worked for them that long because I wanted to do personal financial planning with clients, and I was able to do just that with their full backing and support), CareFirst (a BC & BS health insurance company serving MD, DC and northern VA) and Sprint.\n\nWell, now Zyllion has been added to that list! Thank you, Zyllion!!!\n\nUPDATE -- Aug 16, 2017\nI initially gave a 5 star review after purchasing my \"Zyllion ZMA13BK Shiatsu Pillow Massager with Heat\" two years ago. At the time I was still working as a personal financial advisor (25 years) out of my home office. Since I've had lower back pain for a long time, I've used various \"Shiatsu\" type massagers, including a full back and seat device (this last one had very limited benefits, even though it cost me an arm and a leg.\n\nWell, initially I would often use it off and on much of my work day, which was mostly desk bound (I had clients scattered up and down the east coast, with a heavy concentration in SW Florida, and a smaller exposure here in western Maryland, who had been with me for a long time, so much of the work was done by phone and online, though I still scheduled face-to-face meetings in my clients' homes, including an yearly trip to Florida).\n\nAnd oh did it feel great. I especially loved these features:\n~~ The heat setting!!\n~~ Regularly changes directions.\n~~ The controls couldn't be easier.\n~~ Very compact, making it easier to move around (see next comment)\n~~ And very light, so makes it easier to move around my mid to lower back.\n\nIn many ways, the best was yet to come. Not so much that for the last year or so I'm about 90% retired (for chronic daily migraines--23 years)--yes, that has helped things a whole lot. Thus I don't sit with our computer by our office desk like in the past--no more than about 1-2 hrs/day. But when I do, it is so nice to have my Zyllion Shiatsu Massager. Unfortunately, a tear began to develop on the fabric mesh cover.\n\nI figured that's the way it is (since it was beyond the 1-yr warranty period), so I continued to use it, but only when I absolutely needed it badly. Slowly the tear became bigger. I tried to solution that all men have for any of life's problems--good old duct tape!! Except that, not surprisingly, the moving \"rollers ball-like massagers\" would briefly get caught in the adhesive of the exposed duct tape.\nThen I noticed that there is a zipper which goes nearly all the way around the massager housing. I unzipped it, and figured I could place some duct take on the inside, and this way \"protect\" the adhesive on the outside. No doing, since there is constant friction between the rollers. (I'm sure you engineering brains out there would have predicted all this, but I'm a past preacher and financial advisor, not a mechanical engineer.)\n\nBy the way, I was way impressed by the simplicity of design and the semi-rigid and yet soft \"housing\" all around the motor and the two sets of moving rollers. Since I was \"defeated\" in my homemade solutions, I decided to look around the link to the product, and see if I could find anything of help. I was once again impressed by the very high numbers of highly satisfied customers, like myself.\n\nThen I noticed a statement in one of the photos, which I've attached. It stated, \"Free Replacement Cover Service.\" I just about fell off my chair. So I decided to recheck the questions section, to see if anyone else had run into this problem. Sure enough, and the response from Zyllion had been quite fast, as in this answer to a certain Carlo D., who asked, just less than 2 weeks ago, on Friday, August 4, 2017—\n\n\"I need to replace the cover please help\"\n\nZyllion Customer Service immediately responded the very next business day, Monday August 7, 2017—\n\n\"Dear Carlo:\n\"Thank you for your comment!\n\"We will gladly ship to you a brand new replacement cover at no additional cost.\"\n\nI almost fell off my chair a second time. So I immediately wrote to them, sending my message using the Amazon internal system of communicating with a vendor, shortly after midnight TODAY (12:30 am EDT). By 12:07 pm EDT, not quite 12 hours after writing to them, I had an answer from them, saying that they would indeed send me a replacement cover; they just needed my address.\n\nWhile writing this, here at 3:17 pm EDT, they already put my replacement cover in the mail to me, with a tracking number from the USPS.\n\nThey closed that response with the following, \"Please contact us with any further questions or concerns. At Zyllion, your complete customer satisfaction is our #1 priority.\"\n\nWell, plenty of companies will say that \"customer satisfaction is our #1 priority.\" Hogwash. That's just fancy talk which is rarely delivered in my experience (I'll soon turn 65, so I've been in this game for a long time). Except for a few exceptional companies like American Express, and now I've added Amazon to that list (I've been a client now for 19 years!!!), it is mostly just talk.\n\nZYLLION IS NOT JUST TALK. THEY DELIVER. With an exceptional product. And I can now add, EXCEPTIONAL SERVICE!!! Thank you, thank you, thank you. I'll be singing your praises near and far from now on!!!",
    "reviewer_name": "Marcus",
    "review_date": "August 16, 2017",
    "verified_purchase": true,
    "helpful_count": 166
  },
  {
    "review_id": "R2HAJ56T8JAXMW",
    "rating": 5,
    "review_title": "",
    "review_body": "We bought this massager back in 2018 and it just now started getting tears in it’s cover. Not only that but it has with stood all these years!! 7 YEARS!! Of a 6’4” 250lb man laying on it every night!! I don’t mean resting a leg or sitting back. I mean he puts it in the bad and lays on it btw his shoulder blades and neck. AND, he falls asleep w it, laying on it for the majority of the night. It has never once stalled, shorted out or quit in 7 years! If that doesn’t speak volumes I don’t know what does.\nThe other night he let me know the cover had finally torn so much and he could no longer use it. It still worked perfectly but you need the cover for safety. I got on Amazon and was about to order him another one and thought I would read the reviews and see if anyone else had one as long as we have. Upon reading all the reviews this machine seems to be highly valued by so many!! I also found other people updating their review to say that they reached out to the company and let them know they had the same problem as I did, they just needed a cover. I read where this company would send replacement covers!! FOR FREE!! I thought there is no way. I sent them an email and I got a response back within 24 hrs saying they would be glad to send me a FREE cover if I sent them a photo of our massager. I did and they said the new cover was on the way. It showed up a few days later and was easy to put on and this thing is as good as new!!",
    "reviewer_name": "Patricia Chrestman",
    "review_date": "October 20, 2025",
    "verified_purchase": true,
    "helpful_count": 12
  },
  {
    "review_id": "R1HFGU6PSH9UWV",
    "rating": 5,
    "review_title": "",
    "review_body": "I bought this exact same very powerful device about 10 years ago and it lasted about 3 years. The motor is still good but the cloth wore out and because a pillow case works OK, but is not perfect, I decided to buy another one. It is a miracle for my lower back and does not bog down the motor when I lay on it with all my weight. It's a very powerful motor and I highly recommend this product. DO NOT waste your money on cheap knock-offs. There are none that compare to the overall high quality of this high-performance massager.",
    "reviewer_name": "USFreedom2025-Q",
    "review_date": "November 3, 2025",
    "verified_purchase": true,
    "helpful_count": 7
  },
  {
    "review_id": "R2RMKWKP71QM7U",
    "rating": 5,
    "review_title": "",
    "review_body": "I purchased this product in the fall of 2022 and have had it for 2 and 1/2 years now. I love it! It is so effective and so easy to use. I have a dedicated chair in my room that it stays in, but I can easily take it downstairs to the couch and have it be just as effective. I struggle with a lot of muscle tension, and the option for heat or no heat is so great. It would be nice if it could have some additional settings, but I don't really need it. Not when it's such a dependable worker. I've used it for an hour straight and it still works even when I'm leaning on it. I'm only about 150. But I have other massagers that won't even make it the full 15 or 20 minutes they say that they're supposed to do if I relax against it. This thing is strong and gets the job done! And the heat really lets your muscles relax a little more so the kneading can do its job. I love this thing so much that I've bought a few more to give as gifts to friends. And I like that since it is small it is easy to move from my lower back to my middle back to shoulders. Without having a big heavy chair that's dedicated. Love this little guy!",
    "reviewer_name": "Gorilla Quandary",
    "review_date": "February 20, 2025",
    "verified_purchase": true,
    "helpful_count": 11
  },
  {
    "review_id": "R2WHYO8MAGURJ4",
    "rating": 4,
    "review_title": "",
    "review_body": "This massager works amazingly.. it will kneed deep into your back with non-painful upward and downward compressing pressure. (Like how a masseuse would use their thumbs to circle toward each other) It has heated or non-headed mode, and when the cover wore out (which is inevitable because of the friction created by the kneeding), Zyllion promptly honored the year warranty and mailed me a new cover USPS express. For $40, it's hard not to give this massager 5 stars, however, there are a couple notable flaws which keep it from being an unbelievable deal.\nThe Cons:\n**As mentioned previously, the friction from the kneeding makes it inevitable that the stitching joining materials will be torn. It did, however, take 3-4 months of heavy use (and I'm a 280# guy) before the stitching gave way, so I feel I got my value out of the product. The fact that they replaced the cover so that I will get even more life out of the product is great! Incidentally, I tried sewing a cotton patch to repair the cover myself, however, any material other than a slick nylon/polyester catches on the wheels, and gets twisted into oblivion.\n**When not run in heating mode, the unit can operate fairly indefinitely, though it will gradually heat up from use.\n**When run in heating mode, the unit can run for 3-4 consecutive cycles (a cycle seems to take a couple minutes) before overheating and needing to be left alone for a bit.\n**the quick disconnect is more of an inevitable disconnect. It makes the unit close to unusable, except that you can wrap it around the elastic band so it doesn't pull free. Placing the pillow against a chair for using it will often work the quick disconnect free.\n\nThe Pros:\n** Works amazing! Use it for your lower or upper back, your neck, your thighs or your calves.. the kneeding effect is useful anywhere you can create opposing pressure against the pillow. Works well enough that I hear the occassional pop as my joints loosen up, and my back usually cracks after use. I'd estimate the pillow can handle about 10 lbs of pressure before the motor starts to object. This means if put it on the ground and lay with your back on it, you'll probably slow down, and shorten the life of, the motor.. but if you prop yourself with pillows or foam roller to alleviate the pressure...\n** Has heated or non-heated mode. The heat really helps to work out the kinks, particularly if it's cold out.\n** Really compact. Smaller than most pillows, though not at all squishy.\n** Can run virtually non-stop when not running in heat mode.\n** Can run in both car and home, and, I feel, makes driving more comfortable as it provides lower back support helping me sit upright.",
    "reviewer_name": "Critical Insights",
    "review_date": "June 20, 2018",
    "verified_purchase": true,
    "helpful_count": 27
  },
  {
    "review_id": "R3TW9R1VFZ6E0E",
    "rating": 5,
    "review_title": "",
    "review_body": "The massager is very sturdy and quite strong with the rotating heads massaging and continuing to spin despite weight put on it, while lying down on it or putting a leg or whole body side onto it. My wife loves it and uses it the most, and this is our second one, same model.\n\nThere is a problem with the wiring fraying with repetitive use or its having on-off-on again connectivity issues. I wrapped the wire around the insulation with additional wire wrap near the wire going into the device, the connector parts, and it’s working better, it seems. I did this right after unboxing after the 1-year (warranty extended to 2-year) warranty replacement. The warranty replacement went smoothly, the operator friendly, nice.\n\nOther than the wiring, great product. Great price point too, although we’ve used and have owned much more expensive massagers, my wife keeps using this one and asked for the same make, model, despite my offering to buy her a more high-end one. She says it’s easier to use while on the sofa watching tv or doing work at home.",
    "reviewer_name": "Steven Huh",
    "review_date": "November 6, 2025",
    "verified_purchase": true,
    "helpful_count": 3
  },
  {
    "review_id": "R2HMFLQFW69006",
    "rating": 5,
    "review_title": "",
    "review_body": "As as senior I recently suffered from a fall that injured my lower back muscles. A physical therapist told me I needed myofascial release therapy. It is a manual therapy that uses gentle, sustained pressure to release restrictions in the fascia, the connective tissue that surrounds and supports muscles, bones, and organs. This hands-on technique aims to alleviate pain, stiffness, and dysfunction caused by tight or restricted fascia. It can be used to treat a wide range of conditions, including back and neck pain, fibromyalgia, and sports injuries, with benefits such as increased range of motion and reduced pain.  I tried to find that therapy locally. Cost was 60-80 dollars for 30 minutes. I bought this item and I have used it three times already. It is amazing with it's soothing results. The heat is very comfortable. It has already paid for itself.",
    "reviewer_name": "Pubtym",
    "review_date": "November 8, 2025",
    "verified_purchase": true,
    "helpful_count": 2
  },
  {
    "review_id": "RYY1VU0SNCD7E",
    "rating": 5,
    "review_title": "",
    "review_body": "I love this product and have suggested it to my family and friends with back pain and they have had the same wonderful experience. It works incredibly well and a natural remedy without pain meds or expensive PT. On top of that, the best customer service I have ever experienced.\nI highly recommend this company and products.",
    "reviewer_name": "HM",
    "review_date": "November 3, 2025",
    "verified_purchase": true,
    "helpful_count": 3
  },
  {
    "review_id": "R3N6UEYPR1CN34",
    "rating": 3,
    "review_title": "",
    "review_body": "I'm right in the middle for this little massager. I researched a bunch and this one seemed to have the best reviews, but I'm just a little disappointed for my needs and might get something else.\n\nPROS\n-Holds up well to pressure! I really try to dig into certain places and so far, after about 5 uses, it's still working, doesn't stop, and keeps massaging. I like that a lot. It goes a bit slower sometimes but I trust it will keep going.\n-Heat is really nice and soothing and not too hot. Be warned, however, I was pressing hard on my bare skin and got a bit chafed on the heat setting because I was digging into the skin. It wouldn't do that normally, though, it was the way I was using it. Overall the heat is mild and a perfect temp.\n-Light and has a long cord, fairly easy to move around.\n-Has given me some occasional relief when I've been able to get the right position, for a good night sleep.\n-I have had some luck around the lower/mid-neck, even though it's not designed for that. I just move it so one side gets the area I want, which feels good. But overall this is a bit too wide to give a nice \"squeeze\" to the neck. I'm small, 5'4\" and 125 so if you are bigger with a bigger neck this would maybe be great!\n\nCONS\n-The directional-switch of the motors is automatic. It's nice sometimes, but I think I'd prefer to be able to control when the rotation switches direction. Often I will be in a sweet spot and it will change and then I'll have to adjust a bit. Nothing terrible but if you are looking for something to really unwind a knot and sustain in one area, I'd go with a model that you can dictate when it changes direction.\n-Ball pressure: I find I have a really hard time getting it in a position that doesn't dig TOO hard, or not hard enough. So it's a bit cumbersome and time consuming. For me it's not enough to just lean lightly against a chair and have it pushing on my back. It pokes in weird areas. I find it hard to relax into it unless I find the right spot. When I do, it's nice! But it's like 75% of the time I'm messing with it to get the pressure right. This to me is more about this kind of massager, rather than this specific model. Live and learn!\n-I find the simple way it works is sometimes nice and effective, but overall feels a bit monotonous. Someone mentioned in a review that it's not like a nail salon massage chair and I unfortunately find that it's quite similar to those. Just kinda pushes on you and unless you get the right spot. Again, when I have found good spots it's very nice! So far no lasting relief - I got this for painful shoulder and neck issues and I haven't noticed drastic differences, but nothing worse. I also thought it would help my lower back which gets sore or my hips, and it's not had any major results but we shall see.\n\nSo I don't find it as AMAZING like some little human robot hands as i was secretly dreaming of, but it's certainly nice to have around the house. It's just an \"additional massager\" like if I want a \"general rub down\" somewhere without expecting miracles, and if I can get the hang of where to position it on my wall/chair/couch/body.... but I think I'll have to buy something more detailed with more features for speed or pressure for my main, more painful muscle issues.\n\nBut if you are looking for a simple, 2-way rotational massager to just plug away on one spot for 20 minutes and you don't need as much nuance as me, this is well made! Comes with a nice little slipcover for use with heat.",
    "reviewer_name": "Jamie",
    "review_date": "April 6, 2020",
    "verified_purchase": true,
    "helpful_count": 44
  },
  {
    "review_id": "RIAUIZISKCHA8",
    "rating": 5,
    "review_title": "",
    "review_body": "We've had the Zyllion Shiatsu massager for going on 5 years now. Really the only complaint is that over that time, the exterior fabric started to wear out and made it so we didn't really want to use it anymore. One quick email to customer service and they sent a replacement after we shared them the extent of the wear and tear and a day later there was a USPS notification of a package coming to us. Hopefully going to get another 5 years out of this. I do wish you could control the switching of direction but otherwise, this is a really useful massager that brings us a ton of relief.",
    "reviewer_name": "ethan",
    "review_date": "November 19, 2025",
    "verified_purchase": true,
    "helpful_count": 0
  },
  {
    "review_id": "RUF4WUKMH7G3C",
    "rating": 5,
    "review_title": "",
    "review_body": "UPDATE -- Aug 22, 2017\nWell, Zyllion did exactly as promised. As noted below, the same day I emailed them they responded, and mailed me the replacement with a tracking number. Well, on Friday, Aug 18, I had the replacement cover!!\n\nI'll just quote from the email I just sent them, of course via the Amazon contact seller system (which itself is a fantastic system, since Amazon thus can supervise the communication process in case there are problems, and prevent a seller from getting away with spam, phishing, etc.)\n\n\"Just wanted you to know that I received the replacement cover, and have already replaced the damaged one. I was blown away by how easy it was to do so. Even for this not-as mechanically involved person, I saw simple details, especially in the manner in which the switch is built, which made replacing the cover a piece of cake.\n\"The manner in which you have taken care of this issue for me has thoroughly cemented my relationship with your company and this product. Should I need any other product, I now know where to get it.\n\"Thank you for demonstrating that there still are companies who truly are consumer oriented, and even go beyond what one might normally expect. What a breath of fresh air this experience has been to me.\"\n\nFew companies have earned that kind of respect from me, and most are giants of commerce, from American Express, Lenovo (ThinkPads), Samsung (smartphones) to State Farm (though of late my loyalties with the flatter have waivered); to mid-size companies like Ameriprise Financial, the largest of the bona fide financial planning firms in the country (full disclosure here--I was a board certified financial advisor with them for 25 years, until I retired early 2016; I worked for them that long because I wanted to do personal financial planning with clients, and I was able to do just that with their full backing and support), CareFirst (a BC & BS health insurance company serving MD, DC and northern VA) and Sprint.\n\nWell, now Zyllion has been added to that list! Thank you, Zyllion!!!\n\nUPDATE -- Aug 16, 2017\nI initially gave a 5 star review after purchasing my \"Zyllion ZMA13BK Shiatsu Pillow Massager with Heat\" two years ago. At the time I was still working as a personal financial advisor (25 years) out of my home office. Since I've had lower back pain for a long time, I've used various \"Shiatsu\" type massagers, including a full back and seat device (this last one had very limited benefits, even though it cost me an arm and a leg.\n\nWell, initially I would often use it off and on much of my work day, which was mostly desk bound (I had clients scattered up and down the east coast, with a heavy concentration in SW Florida, and a smaller exposure here in western Maryland, who had been with me for a long time, so much of the work was done by phone and online, though I still scheduled face-to-face meetings in my clients' homes, including an yearly trip to Florida).\n\nAnd oh did it feel great. I especially loved these features:\n~~ The heat setting!!\n~~ Regularly changes directions.\n~~ The controls couldn't be easier.\n~~ Very compact, making it easier to move around (see next comment)\n~~ And very light, so makes it easier to move around my mid to lower back.\n\nIn many ways, the best was yet to come. Not so much that for the last year or so I'm about 90% retired (for chronic daily migraines--23 years)--yes, that has helped things a whole lot. Thus I don't sit with our computer by our office desk like in the past--no more than about 1-2 hrs/day. But when I do, it is so nice to have my Zyllion Shiatsu Massager. Unfortunately, a tear began to develop on the fabric mesh cover.\n\nI figured that's the way it is (since it was beyond the 1-yr warranty period), so I continued to use it, but only when I absolutely needed it badly. Slowly the tear became bigger. I tried to solution that all men have for any of life's problems--good old duct tape!! Except that, not surprisingly, the moving \"rollers ball-like massagers\" would briefly get caught in the adhesive of the exposed duct tape.\nThen I noticed that there is a zipper which goes nearly all the way around the massager housing. I unzipped it, and figured I could place some duct take on the inside, and this way \"protect\" the adhesive on the outside. No doing, since there is constant friction between the rollers. (I'm sure you engineering brains out there would have predicted all this, but I'm a past preacher and financial advisor, not a mechanical engineer.)\n\nBy the way, I was way impressed by the simplicity of design and the semi-rigid and yet soft \"housing\" all around the motor and the two sets of moving rollers. Since I was \"defeated\" in my homemade solutions, I decided to look around the link to the product, and see if I could find anything of help. I was once again impressed by the very high numbers of highly satisfied customers, like myself.\n\nThen I noticed a statement in one of the photos, which I've attached. It stated, \"Free Replacement Cover Service.\" I just about fell off my chair. So I decided to recheck the questions section, to see if anyone else had run into this problem. Sure enough, and the response from Zyllion had been quite fast, as in this answer to a certain Carlo D., who asked, just less than 2 weeks ago, on Friday, August 4, 2017—\n\n\"I need to replace the cover please help\"\n\nZyllion Customer Service immediately responded the very next business day, Monday August 7, 2017—\n\n\"Dear Carlo:\n\"Thank you for your comment!\n\"We will gladly ship to you a brand new replacement cover at no additional cost.\"\n\nI almost fell off my chair a second time. So I immediately wrote to them, sending my message using the Amazon internal system of communicating with a vendor, shortly after midnight TODAY (12:30 am EDT). By 12:07 pm EDT, not quite 12 hours after writing to them, I had an answer from them, saying that they would indeed send me a replacement cover; they just needed my address.\n\nWhile writing this, here at 3:17 pm EDT, they already put my replacement cover in the mail to me, with a tracking number from the USPS.\n\nThey closed that response with the following, \"Please contact us with any further questions or concerns. At Zyllion, your complete customer satisfaction is our #1 priority.\"\n\nWell, plenty of companies will say that \"customer satisfaction is our #1 priority.\" Hogwash. That's just fancy talk which is rarely delivered in my experience (I'll soon turn 65, so I've been in this game for a long time). Except for a few exceptional companies like American Express, and now I've added Amazon to that list (I've been a client now for 19 years!!!), it is mostly just talk.\n\nZYLLION IS NOT JUST TALK. THEY DELIVER. With an exceptional product. And I can now add, EXCEPTIONAL SERVICE!!! Thank you, thank you, thank you. I'll be singing your praises near and far from now on!!!",
    "reviewer_name": "Marcus",
    "review_date": "August 16, 2017",
    "verified_purchase": true,
    "helpful_count": 166
  },
  {
    "review_id": "R2HAJ56T8JAXMW",
    "rating": 5,
    "review_title": "",
    "review_body": "We bought this massager back in 2018 and it just now started getting tears in it’s cover. Not only that but it has with stood all these years!! 7 YEARS!! Of a 6’4” 250lb man laying on it every night!! I don’t mean resting a leg or sitting back. I mean he puts it in the bad and lays on it btw his shoulder blades and neck. AND, he falls asleep w it, laying on it for the majority of the night. It has never once stalled, shorted out or quit in 7 years! If that doesn’t speak volumes I don’t know what does.\nThe other night he let me know the cover had finally torn so much and he could no longer use it. It still worked perfectly but you need the cover for safety. I got on Amazon and was about to order him another one and thought I would read the reviews and see if anyone else had one as long as we have. Upon reading all the reviews this machine seems to be highly valued by so many!! I also found other people updating their review to say that they reached out to the company and let them know they had the same problem as I did, they just needed a cover. I read where this company would send replacement covers!! FOR FREE!! I thought there is no way. I sent them an email and I got a response back within 24 hrs saying they would be glad to send me a FREE cover if I sent them a photo of our massager. I did and they said the new cover was on the way. It showed up a few days later and was easy to put on and this thing is as good as new!!",
    "reviewer_name": "Patricia Chrestman",
    "review_date": "October 20, 2025",
    "verified_purchase": true,
    "helpful_count": 12
  },
  {
    "review_id": "R1HFGU6PSH9UWV",
    "rating": 5,
    "review_title": "",
    "review_body": "I bought this exact same very powerful device about 10 years ago and it lasted about 3 years. The motor is still good but the cloth wore out and because a pillow case works OK, but is not perfect, I decided to buy another one. It is a miracle for my lower back and does not bog down the motor when I lay on it with all my weight. It's a very powerful motor and I highly recommend this product. DO NOT waste your money on cheap knock-offs. There are none that compare to the overall high quality of this high-performance massager.",
    "reviewer_name": "USFreedom2025-Q",
    "review_date": "November 3, 2025",
    "verified_purchase": true,
    "helpful_count": 7
  },
  {
    "review_id": "R2RMKWKP71QM7U",
    "rating": 5,
    "review_title": "",
    "review_body": "I purchased this product in the fall of 2022 and have had it for 2 and 1/2 years now. I love it! It is so effective and so easy to use. I have a dedicated chair in my room that it stays in, but I can easily take it downstairs to the couch and have it be just as effective. I struggle with a lot of muscle tension, and the option for heat or no heat is so great. It would be nice if it could have some additional settings, but I don't really need it. Not when it's such a dependable worker. I've used it for an hour straight and it still works even when I'm leaning on it. I'm only about 150. But I have other massagers that won't even make it the full 15 or 20 minutes they say that they're supposed to do if I relax against it. This thing is strong and gets the job done! And the heat really lets your muscles relax a little more so the kneading can do its job. I love this thing so much that I've bought a few more to give as gifts to friends. And I like that since it is small it is easy to move from my lower back to my middle back to shoulders. Without having a big heavy chair that's dedicated. Love this little guy!",
    "reviewer_name": "Gorilla Quandary",
    "review_date": "February 20, 2025",
    "verified_purchase": true,
    "helpful_count": 11
  },
  {
    "review_id": "R2WHYO8MAGURJ4",
    "rating": 4,
    "review_title": "",
    "review_body": "This massager works amazingly.. it will kneed deep into your back with non-painful upward and downward compressing pressure. (Like how a masseuse would use their thumbs to circle toward each other) It has heated or non-headed mode, and when the cover wore out (which is inevitable because of the friction created by the kneeding), Zyllion promptly honored the year warranty and mailed me a new cover USPS express. For $40, it's hard not to give this massager 5 stars, however, there are a couple notable flaws which keep it from being an unbelievable deal.\nThe Cons:\n**As mentioned previously, the friction from the kneeding makes it inevitable that the stitching joining materials will be torn. It did, however, take 3-4 months of heavy use (and I'm a 280# guy) before the stitching gave way, so I feel I got my value out of the product. The fact that they replaced the cover so that I will get even more life out of the product is great! Incidentally, I tried sewing a cotton patch to repair the cover myself, however, any material other than a slick nylon/polyester catches on the wheels, and gets twisted into oblivion.\n**When not run in heating mode, the unit can operate fairly indefinitely, though it will gradually heat up from use.\n**When run in heating mode, the unit can run for 3-4 consecutive cycles (a cycle seems to take a couple minutes) before overheating and needing to be left alone for a bit.\n**the quick disconnect is more of an inevitable disconnect. It makes the unit close to unusable, except that you can wrap it around the elastic band so it doesn't pull free. Placing the pillow against a chair for using it will often work the quick disconnect free.\n\nThe Pros:\n** Works amazing! Use it for your lower or upper back, your neck, your thighs or your calves.. the kneeding effect is useful anywhere you can create opposing pressure against the pillow. Works well enough that I hear the occassional pop as my joints loosen up, and my back usually cracks after use. I'd estimate the pillow can handle about 10 lbs of pressure before the motor starts to object. This means if put it on the ground and lay with your back on it, you'll probably slow down, and shorten the life of, the motor.. but if you prop yourself with pillows or foam roller to alleviate the pressure...\n** Has heated or non-heated mode. The heat really helps to work out the kinks, particularly if it's cold out.\n** Really compact. Smaller than most pillows, though not at all squishy.\n** Can run virtually non-stop when not running in heat mode.\n** Can run in both car and home, and, I feel, makes driving more comfortable as it provides lower back support helping me sit upright.",
    "reviewer_name": "Critical Insights",
    "review_date": "June 20, 2018",
    "verified_purchase": true,
    "helpful_count": 27
  },
  {
    "review_id": "R3TW9R1VFZ6E0E",
    "rating": 5,
    "review_title": "",
    "review_body": "The massager is very sturdy and quite strong with the rotating heads massaging and continuing to spin despite weight put on it, while lying down on it or putting a leg or whole body side onto it. My wife loves it and uses it the most, and this is our second one, same model.\n\nThere is a problem with the wiring fraying with repetitive use or its having on-off-on again connectivity issues. I wrapped the wire around the insulation with additional wire wrap near the wire going into the device, the connector parts, and it’s working better, it seems. I did this right after unboxing after the 1-year (warranty extended to 2-year) warranty replacement. The warranty replacement went smoothly, the operator friendly, nice.\n\nOther than the wiring, great product. Great price point too, although we’ve used and have owned much more expensive massagers, my wife keeps using this one and asked for the same make, model, despite my offering to buy her a more high-end one. She says it’s easier to use while on the sofa watching tv or doing work at home.",
    "reviewer_name": "Steven Huh",
    "review_date": "November 6, 2025",
    "verified_purchase": true,
    "helpful_count": 3
  },
  {
    "review_id": "R2HMFLQFW69006",
    "rating": 5,
    "review_title": "",
    "review_body": "As as senior I recently suffered from a fall that injured my lower back muscles. A physical therapist told me I needed myofascial release therapy. It is a manual therapy that uses gentle, sustained pressure to release restrictions in the fascia, the connective tissue that surrounds and supports muscles, bones, and organs. This hands-on technique aims to alleviate pain, stiffness, and dysfunction caused by tight or restricted fascia. It can be used to treat a wide range of conditions, including back and neck pain, fibromyalgia, and sports injuries, with benefits such as increased range of motion and reduced pain.  I tried to find that therapy locally. Cost was 60-80 dollars for 30 minutes. I bought this item and I have used it three times already. It is amazing with it's soothing results. The heat is very comfortable. It has already paid for itself.",
    "reviewer_name": "Pubtym",
    "review_date": "November 8, 2025",
    "verified_purchase": true,
    "helpful_count": 2
  },
  {
    "review_id": "RYY1VU0SNCD7E",
    "rating": 5,
    "review_title": "",
    "review_body": "I love this product and have suggested it to my family and friends with back pain and they have had the same wonderful experience. It works incredibly well and a natural remedy without pain meds or expensive PT. On top of that, the best customer service I have ever experienced.\nI highly recommend this company and products.",
    "reviewer_name": "HM",
    "review_date": "November 3, 2025",
    "verified_purchase": true,
    "helpful_count": 3
  },
  {
    "review_id": "R3N6UEYPR1CN34",
    "rating": 3,
    "review_title": "",
    "review_body": "I'm right in the middle for this little massager. I researched a bunch and this one seemed to have the best reviews, but I'm just a little disappointed for my needs and might get something else.\n\nPROS\n-Holds up well to pressure! I really try to dig into certain places and so far, after about 5 uses, it's still working, doesn't stop, and keeps massaging. I like that a lot. It goes a bit slower sometimes but I trust it will keep going.\n-Heat is really nice and soothing and not too hot. Be warned, however, I was pressing hard on my bare skin and got a bit chafed on the heat setting because I was digging into the skin. It wouldn't do that normally, though, it was the way I was using it. Overall the heat is mild and a perfect temp.\n-Light and has a long cord, fairly easy to move around.\n-Has given me some occasional relief when I've been able to get the right position, for a good night sleep.\n-I have had some luck around the lower/mid-neck, even though it's not designed for that. I just move it so one side gets the area I want, which feels good. But overall this is a bit too wide to give a nice \"squeeze\" to the neck. I'm small, 5'4\" and 125 so if you are bigger with a bigger neck this would maybe be great!\n\nCONS\n-The directional-switch of the motors is automatic. It's nice sometimes, but I think I'd prefer to be able to control when the rotation switches direction. Often I will be in a sweet spot and it will change and then I'll have to adjust a bit. Nothing terrible but if you are looking for something to really unwind a knot and sustain in one area, I'd go with a model that you can dictate when it changes direction.\n-Ball pressure: I find I have a really hard time getting it in a position that doesn't dig TOO hard, or not hard enough. So it's a bit cumbersome and time consuming. For me it's not enough to just lean lightly against a chair and have it pushing on my back. It pokes in weird areas. I find it hard to relax into it unless I find the right spot. When I do, it's nice! But it's like 75% of the time I'm messing with it to get the pressure right. This to me is more about this kind of massager, rather than this specific model. Live and learn!\n-I find the simple way it works is sometimes nice and effective, but overall feels a bit monotonous. Someone mentioned in a review that it's not like a nail salon massage chair and I unfortunately find that it's quite similar to those. Just kinda pushes on you and unless you get the right spot. Again, when I have found good spots it's very nice! So far no lasting relief - I got this for painful shoulder and neck issues and I haven't noticed drastic differences, but nothing worse. I also thought it would help my lower back which gets sore or my hips, and it's not had any major results but we shall see.\n\nSo I don't find it as AMAZING like some little human robot hands as i was secretly dreaming of, but it's certainly nice to have around the house. It's just an \"additional massager\" like if I want a \"general rub down\" somewhere without expecting miracles, and if I can get the hang of where to position it on my wall/chair/couch/body.... but I think I'll have to buy something more detailed with more features for speed or pressure for my main, more painful muscle issues.\n\nBut if you are looking for a simple, 2-way rotational massager to just plug away on one spot for 20 minutes and you don't need as much nuance as me, this is well made! Comes with a nice little slipcover for use with heat.",
    "reviewer_name": "Jamie",
    "review_date": "April 6, 2020",
    "verified_purchase": true,
    "helpful_count": 44
  },
  {
    "review_id": "RIAUIZISKCHA8",
    "rating": 5,
    "review_title": "",
    "review_body": "We've had the Zyllion Shiatsu massager for going on 5 years now. Really the only complaint is that over that time, the exterior fabric started to wear out and made it so we didn't really want to use it anymore. One quick email to customer service and they sent a replacement after we shared them the extent of the wear and tear and a day later there was a USPS notification of a package coming to us. Hopefully going to get another 5 years out of this. I do wish you could control the switching of direction but otherwise, this is a really useful massager that brings us a ton of relief.",
    "reviewer_name": "ethan",
    "review_date": "November 19, 2025",
    "verified_purchase": true,
    "helpful_count": 0
  },
  {
    "review_id": "RUF4WUKMH7G3C",
    "rating": 5,
    "review_title": "",
    "review_body": "UPDATE -- Aug 22, 2017\nWell, Zyllion did exactly as promised. As noted below, the same day I emailed them they responded, and mailed me the replacement with a tracking number. Well, on Friday, Aug 18, I had the replacement cover!!\n\nI'll just quote from the email I just sent them, of course via the Amazon contact seller system (which itself is a fantastic system, since Amazon thus can supervise the communication process in case there are problems, and prevent a seller from getting away with spam, phishing, etc.)\n\n\"Just wanted you to know that I received the replacement cover, and have already replaced the damaged one. I was blown away by how easy it was to do so. Even for this not-as mechanically involved person, I saw simple details, especially in the manner in which the switch is built, which made replacing the cover a piece of cake.\n\"The manner in which you have taken care of this issue for me has thoroughly cemented my relationship with your company and this product. Should I need any other product, I now know where to get it.\n\"Thank you for demonstrating that there still are companies who truly are consumer oriented, and even go beyond what one might normally expect. What a breath of fresh air this experience has been to me.\"\n\nFew companies have earned that kind of respect from me, and most are giants of commerce, from American Express, Lenovo (ThinkPads), Samsung (smartphones) to State Farm (though of late my loyalties with the flatter have waivered); to mid-size companies like Ameriprise Financial, the largest of the bona fide financial planning firms in the country (full disclosure here--I was a board certified financial advisor with them for 25 years, until I retired early 2016; I worked for them that long because I wanted to do personal financial planning with clients, and I was able to do just that with their full backing and support), CareFirst (a BC & BS health insurance company serving MD, DC and northern VA) and Sprint.\n\nWell, now Zyllion has been added to that list! Thank you, Zyllion!!!\n\nUPDATE -- Aug 16, 2017\nI initially gave a 5 star review after purchasing my \"Zyllion ZMA13BK Shiatsu Pillow Massager with Heat\" two years ago. At the time I was still working as a personal financial advisor (25 years) out of my home office. Since I've had lower back pain for a long time, I've used various \"Shiatsu\" type massagers, including a full back and seat device (this last one had very limited benefits, even though it cost me an arm and a leg.\n\nWell, initially I would often use it off and on much of my work day, which was mostly desk bound (I had clients scattered up and down the east coast, with a heavy concentration in SW Florida, and a smaller exposure here in western Maryland, who had been with me for a long time, so much of the work was done by phone and online, though I still scheduled face-to-face meetings in my clients' homes, including an yearly trip to Florida).\n\nAnd oh did it feel great. I especially loved these features:\n~~ The heat setting!!\n~~ Regularly changes directions.\n~~ The controls couldn't be easier.\n~~ Very compact, making it easier to move around (see next comment)\n~~ And very light, so makes it easier to move around my mid to lower back.\n\nIn many ways, the best was yet to come. Not so much that for the last year or so I'm about 90% retired (for chronic daily migraines--23 years)--yes, that has helped things a whole lot. Thus I don't sit with our computer by our office desk like in the past--no more than about 1-2 hrs/day. But when I do, it is so nice to have my Zyllion Shiatsu Massager. Unfortunately, a tear began to develop on the fabric mesh cover.\n\nI figured that's the way it is (since it was beyond the 1-yr warranty period), so I continued to use it, but only when I absolutely needed it badly. Slowly the tear became bigger. I tried to solution that all men have for any of life's problems--good old duct tape!! Except that, not surprisingly, the moving \"rollers ball-like massagers\" would briefly get caught in the adhesive of the exposed duct tape.\nThen I noticed that there is a zipper which goes nearly all the way around the massager housing. I unzipped it, and figured I could place some duct take on the inside, and this way \"protect\" the adhesive on the outside. No doing, since there is constant friction between the rollers. (I'm sure you engineering brains out there would have predicted all this, but I'm a past preacher and financial advisor, not a mechanical engineer.)\n\nBy the way, I was way impressed by the simplicity of design and the semi-rigid and yet soft \"housing\" all around the motor and the two sets of moving rollers. Since I was \"defeated\" in my homemade solutions, I decided to look around the link to the product, and see if I could find anything of help. I was once again impressed by the very high numbers of highly satisfied customers, like myself.\n\nThen I noticed a statement in one of the photos, which I've attached. It stated, \"Free Replacement Cover Service.\" I just about fell off my chair. So I decided to recheck the questions section, to see if anyone else had run into this problem. Sure enough, and the response from Zyllion had been quite fast, as in this answer to a certain Carlo D., who asked, just less than 2 weeks ago, on Friday, August 4, 2017—\n\n\"I need to replace the cover please help\"\n\nZyllion Customer Service immediately responded the very next business day, Monday August 7, 2017—\n\n\"Dear Carlo:\n\"Thank you for your comment!\n\"We will gladly ship to you a brand new replacement cover at no additional cost.\"\n\nI almost fell off my chair a second time. So I immediately wrote to them, sending my message using the Amazon internal system of communicating with a vendor, shortly after midnight TODAY (12:30 am EDT). By 12:07 pm EDT, not quite 12 hours after writing to them, I had an answer from them, saying that they would indeed send me a replacement cover; they just needed my address.\n\nWhile writing this, here at 3:17 pm EDT, they already put my replacement cover in the mail to me, with a tracking number from the USPS.\n\nThey closed that response with the following, \"Please contact us with any further questions or concerns. At Zyllion, your complete customer satisfaction is our #1 priority.\"\n\nWell, plenty of companies will say that \"customer satisfaction is our #1 priority.\" Hogwash. That's just fancy talk which is rarely delivered in my experience (I'll soon turn 65, so I've been in this game for a long time). Except for a few exceptional companies like American Express, and now I've added Amazon to that list (I've been a client now for 19 years!!!), it is mostly just talk.\n\nZYLLION IS NOT JUST TALK. THEY DELIVER. With an exceptional product. And I can now add, EXCEPTIONAL SERVICE!!! Thank you, thank you, thank you. I'll be singing your praises near and far from now on!!!",
    "reviewer_name": "Marcus",
    "review_date": "August 16, 2017",
    "verified_purchase": true,
    "helpful_count": 166
  },
  {
    "review_id": "R2HAJ56T8JAXMW",
    "rating": 5,
    "review_title": "",
    "review_body": "We bought this massager back in 2018 and it just now started getting tears in it’s cover. Not only that but it has with stood all these years!! 7 YEARS!! Of a 6’4” 250lb man laying on it every night!! I don’t mean resting a leg or sitting back. I mean he puts it in the bad and lays on it btw his shoulder blades and neck. AND, he falls asleep w it, laying on it for the majority of the night. It has never once stalled, shorted out or quit in 7 years! If that doesn’t speak volumes I don’t know what does.\nThe other night he let me know the cover had finally torn so much and he could no longer use it. It still worked perfectly but you need the cover for safety. I got on Amazon and was about to order him another one and thought I would read the reviews and see if anyone else had one as long as we have. Upon reading all the reviews this machine seems to be highly valued by so many!! I also found other people updating their review to say that they reached out to the company and let them know they had the same problem as I did, they just needed a cover. I read where this company would send replacement covers!! FOR FREE!! I thought there is no way. I sent them an email and I got a response back within 24 hrs saying they would be glad to send me a FREE cover if I sent them a photo of our massager. I did and they said the new cover was on the way. It showed up a few days later and was easy to put on and this thing is as good as new!!",
    "reviewer_name": "Patricia Chrestman",
    "review_date": "October 20, 2025",
    "verified_purchase": true,
    "helpful_count": 12
  }
]